; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-14)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 6 of 14
2. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 14
3. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 7 of 14
4. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 7 of 14
5. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 7 of 14
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 7 of 14
7. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 8 of 14
8. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 8 of 14
9. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 8 of 14
10. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 8 of 14
11. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 9 of 14
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 9 of 14
13. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 9 of 14
14. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 14
15. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 10 of 14
16. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 10 of 14
17. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 10 of 14
18. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 10 of 14
19. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 11 of 14
20. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 11 of 14
21. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 11 of 14
22. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 11 of 14
23. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 12 of 14
24. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 14
25. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 12 of 14
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 14
27. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 13 of 14
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 13 of 14
29. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 13 of 14
30. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 14
31. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 14 of 14
